app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new (
   school_classes_params
    )
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "new "], ["room_number", 1], ["created_at", "2020-10-07 15:48:00.946860"], ["updated_at", "2020-10-07 15:48:00.946860"]]